#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
<pre>terraform
module.thadmin_hosting.aws_s3_bucket.this: Refreshing state... [id=thalia-thadmin-staging]
module.thadmin_routing.module.cloudfront.aws_cloudfront_origin_access_identity.this["s3_bucket"]: Refreshing state... [id=E3JOC36ODMBL65]
module.thadmin_routing.module.acm.aws_acm_certificate.this: Refreshing state... [id=arn:aws:acm:us-east-1:627002765486:certificate/565d3a00-d047-48f2-956a-aed08dd6956b]
module.thadmin_routing.module.acm.aws_route53_record.validation["thadmin-staging.technicie.nl"]: Refreshing state... [id=Z3I4ZHBBD5NSHU__f4c1968cf0da5157d0f46ed63ecf426e.thadmin-staging.technicie.nl._CNAME]
module.thadmin_routing.module.acm.aws_acm_certificate_validation.this: Refreshing state... [id=2021-04-14 20:17:10 +0000 UTC]
module.thadmin_routing.aws_s3_bucket_policy.bucket_policy: Refreshing state... [id=thalia-thadmin-staging]
module.thadmin_routing.module.cloudfront.aws_cloudfront_distribution.this[0]: Refreshing state... [id=E2ZP8HCBLISQFN]
module.thadmin_routing.aws_route53_record.api: Refreshing state... [id=Z3I4ZHBBD5NSHU_thadmin-staging_A]
module.thadmin_hosting.aws_s3_bucket_object.code_build_object["index.html"]: Refreshing state... [id=index.html]
module.thadmin_hosting.aws_s3_bucket_object.code_build_object["css/chunk-vendors.52eaf30c.css"]: Refreshing state... [id=css/chunk-vendors.52eaf30c.css]
module.thadmin_hosting.aws_s3_bucket_object.code_build_object["css/app.0d181c63.css"]: Refreshing state... [id=css/app.0d181c63.css]
module.thadmin_hosting.aws_s3_bucket_object.code_build_object["js/chunk-0a25be67.d7904046.js"]: Refreshing state... [id=js/chunk-0a25be67.d7904046.js]
module.thadmin_hosting.aws_s3_bucket_object.code_build_object["img/backgroundImage.5f59aad8.jpg"]: Refreshing state... [id=img/backgroundImage.5f59aad8.jpg]
module.thadmin_hosting.aws_s3_bucket_object.code_build_object["js/chunk-vendors.1b11d1c2.js"]: Refreshing state... [id=js/chunk-vendors.1b11d1c2.js]
module.thadmin_hosting.aws_s3_bucket_object.code_build_object["js/chunk-0a25be67.d7904046.js.map"]: Refreshing state... [id=js/chunk-0a25be67.d7904046.js.map]
module.thadmin_hosting.aws_s3_bucket_object.code_build_object["js/app.34feb091.js.map"]: Refreshing state... [id=js/app.34feb091.js.map]
module.thadmin_hosting.aws_s3_bucket_object.code_build_object["js/app.34feb091.js"]: Refreshing state... [id=js/app.34feb091.js]
module.thadmin_hosting.aws_s3_bucket_object.code_build_object["js/chunk-vendors.1b11d1c2.js.map"]: Refreshing state... [id=js/chunk-vendors.1b11d1c2.js.map]
module.thadmin_hosting.aws_s3_bucket_object.code_build_object["img/anonymousUser.61cf6ed7.jpg"]: Refreshing state... [id=img/anonymousUser.61cf6ed7.jpg]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # module.thadmin_hosting.aws_s3_bucket_object.code_build_object["css/app.0d181c63.css"] will be destroyed
  - resource "aws_s3_bucket_object" "code_build_object" {
      - acl                = "private" -> null
      - bucket             = "thalia-thadmin-staging" -> null
      - bucket_key_enabled = false -> null
      - content_type       = "text/css" -> null
      - etag               = "1546921b35178d340ee9df1b2e0f376b" -> null
      - force_destroy      = false -> null
      - id                 = "css/app.0d181c63.css" -> null
      - key                = "css/app.0d181c63.css" -> null
      - metadata           = {} -> null
      - source             = "/home/runner/work/thadmin/thadmin/infra/modules/hosting/../../..//dist/css/app.0d181c63.css" -> null
      - storage_class      = "STANDARD" -> null
      - tags               = {} -> null
      - tags_all           = {} -> null
    }

  # module.thadmin_hosting.aws_s3_bucket_object.code_build_object["css/app.486a89ee.css"] will be created
  + resource "aws_s3_bucket_object" "code_build_object" {
      + acl                    = "private"
      + bucket                 = "thalia-thadmin-staging"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "text/css"
      + etag                   = "b04addb99429c25153f4c3a2e7439264"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "css/app.486a89ee.css"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "/home/runner/work/thadmin/thadmin/infra/modules/hosting/../../..//dist/css/app.486a89ee.css"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.thadmin_hosting.aws_s3_bucket_object.code_build_object["index.html"] will be updated in-place
  ~ resource "aws_s3_bucket_object" "code_build_object" {
      ~ etag               = "29d179496e07493302573e649cd426bd" -> "622c62d47855c3b80ecd09155596ec09"
        id                 = "index.html"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.thadmin_hosting.aws_s3_bucket_object.code_build_object["js/app.34feb091.js"] will be destroyed
  - resource "aws_s3_bucket_object" "code_build_object" {
      - acl                = "private" -> null
      - bucket             = "thalia-thadmin-staging" -> null
      - bucket_key_enabled = false -> null
      - content_type       = "text/javascript" -> null
      - etag               = "ad8177e8837b2b9301ee7307cf6d3234" -> null
      - force_destroy      = false -> null
      - id                 = "js/app.34feb091.js" -> null
      - key                = "js/app.34feb091.js" -> null
      - metadata           = {} -> null
      - source             = "/home/runner/work/thadmin/thadmin/infra/modules/hosting/../../..//dist/js/app.34feb091.js" -> null
      - storage_class      = "STANDARD" -> null
      - tags               = {} -> null
      - tags_all           = {} -> null
    }

  # module.thadmin_hosting.aws_s3_bucket_object.code_build_object["js/app.34feb091.js.map"] will be destroyed
  - resource "aws_s3_bucket_object" "code_build_object" {
      - acl                = "private" -> null
      - bucket             = "thalia-thadmin-staging" -> null
      - bucket_key_enabled = false -> null
      - content_type       = "application/octet-stream" -> null
      - etag               = "181931310e37bfbf95d0c35e3cd13f45" -> null
      - force_destroy      = false -> null
      - id                 = "js/app.34feb091.js.map" -> null
      - key                = "js/app.34feb091.js.map" -> null
      - metadata           = {} -> null
      - source             = "/home/runner/work/thadmin/thadmin/infra/modules/hosting/../../..//dist/js/app.34feb091.js.map" -> null
      - storage_class      = "STANDARD" -> null
      - tags               = {} -> null
      - tags_all           = {} -> null
    }

  # module.thadmin_hosting.aws_s3_bucket_object.code_build_object["js/app.f0aca9b8.js"] will be created
  + resource "aws_s3_bucket_object" "code_build_object" {
      + acl                    = "private"
      + bucket                 = "thalia-thadmin-staging"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "text/javascript"
      + etag                   = "fe60d45d39bd7edccd3175791badb0a5"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "js/app.f0aca9b8.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "/home/runner/work/thadmin/thadmin/infra/modules/hosting/../../..//dist/js/app.f0aca9b8.js"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.thadmin_hosting.aws_s3_bucket_object.code_build_object["js/app.f0aca9b8.js.map"] will be created
  + resource "aws_s3_bucket_object" "code_build_object" {
      + acl                    = "private"
      + bucket                 = "thalia-thadmin-staging"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = "e8edf5d38050eceec77c879f328e9efa"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "js/app.f0aca9b8.js.map"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "/home/runner/work/thadmin/thadmin/infra/modules/hosting/../../..//dist/js/app.f0aca9b8.js.map"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

Plan: 3 to add, 1 to change, 3 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.

</pre>
</details>